Reports/ГрафикМонтажей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ГрафикМонтажей</Name>
		</Properties>
	</Report>
</MetaDataObject>

Documents/Монтаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Монтаж</Name>
			<BasedOn>
				<xr:Item>Document.Спецификация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СвободныеМонтажники</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Монтажник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузчик1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузчик2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Договор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Договор</Name>
			<BasedOn>
				<xr:Item>Document.Спецификация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиФакт</xr:Item>
				<xr:Item>AccumulationRegister.РеализованныеИзделия</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановитьНеПозднее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСЮрЛицом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарплатаДизайнера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцевРассрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поделиться</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаБезСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Рассрочка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ГрафикМонтажей/Ext/ManagerModule.bsl
Функция СформироватьОтчет(ПараметрыОтчета) Экспорт
	
	НачалоПериода = ПараметрыОтчета.Период.ДатаНачала;
	КонецПериода = ПараметрыОтчета.Период.ДатаОкончания;
	
	Макет = Отчеты.ГрафикМонтажей.ПолучитьМакет("ГрафикМонтажа");
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Монтаж.Монтажник КАК Монтажник,
	|	Монтаж.Ссылка КАК СсылкаНаМонтаж,
	|	Монтаж.Ссылка.Дата КАК ДатаДоставки,
	|	Монтаж.ДатаМонтажа КАК Дата,
	|	Монтаж.Ссылка.Экспедитор КАК Экспедитор,
	|	Монтаж.Спецификация.АдресМонтажа КАК АдресМонтажа,
	|	Монтаж.Спецификация.Доставка КАК Доставка,
	|	Монтаж.Спецификация.Номер КАК НомерСпецификации,
	|	Монтаж.ДатаМонтажа КАК ДатаМонтажа,
	|	Договор.Номер КАК НомерДоговора,
	|	Договор.Контрагент.Телефон КАК Телефон,
	|	Договор.Ссылка КАК СсылкаНаДоговор,
	|	Договор.Контрагент.ТелефонДополнительный КАК ТелефонДополнительный
	|ИЗ
	|	Документ.Монтаж КАК Монтаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Договор КАК Договор
	|		ПО Монтаж.Спецификация = Договор.Спецификация
	|ГДЕ
	|	Монтаж.ДатаМонтажа МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Монтаж.Ссылка.Проведен
	|	И Монтаж.Монтажник В (&МассивМонтажников)
	|	И Договор.Офис.Город В (&МассивГородов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Если ПараметрыОтчета.МассивМонтажников.Количество() = 0 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Монтаж.Монтажник В (&МассивМонтажников)", "");
		
	КонецЕсли;
	
	Если ПараметрыОтчета.МассивГородов.Количество() = 0 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Договор.Офис.Город В (&МассивГородов)", "");
		
	КонецЕсли;
	
	Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
	Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
	Запрос.Параметры.Вставить("МассивМонтажников", ПараметрыОтчета.МассивМонтажников);
	Запрос.Параметры.Вставить("МассивГородов", ПараметрыОтчета.МассивГородов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.ПериодСтр = ПредставлениеПериода(НачалоПериода, КонецПериода);
	Строка = Макет.ПолучитьОбласть("Строка");
	ПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ТабДок 									= Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб 				= Истина;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 						= Ложь;
	ТабДок.ТолькоПросмотр 			= Ложь;
	
	ТабДок.Вывести(Шапка);
		
	НомерСтроки = 5;
	НачалоТекДата = 5;
	ТекДата = '0001.01.01';
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекДата) Тогда
			ТекДата = НачалоДня(Выборка.ДатаМонтажа);
		КонецЕсли;
		
		НомерСтроки = 1 + НомерСтроки;
		
		Если НачалоДня(ТекДата) <> НачалоДня(Выборка.ДатаМонтажа) Тогда
			
			ТабДок.Вывести(ПустаяСтрока);
			ТабДок.Вывести(ПустаяСтрока);
			НомерСтроки = 2 + НомерСтроки;
			
			Область = ТабДок.Область(НачалоТекДата, 1, НомерСтроки - 2, 1);
			Область.Объединить();
			ТекДата = НачалоДня(Выборка.ДатаМонтажа);
			НачалоТекДата = НомерСтроки - 1;
			
		КонецЕсли;
		
		Строка.Параметры.Заполнить(Выборка);
		
		Адрес = ЛексСервер.ПолучитьСтруктуруИзАдреса(Выборка.АдресМонтажа);
		Строка.Параметры.Подъезд = Адрес.Подъезд;
		Строка.Параметры.Этаж = Адрес.Этаж;
		Строка.Параметры.Код = Адрес.КодПодъезда;
		Строка.Параметры.НомерСпецификации = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(Выборка.НомерСпецификации, "0");
		Строка.Параметры.Дата = Формат((Выборка.ДатаМонтажа), "ДФ = дд.ММ")+" "+Формат((Выборка.ДатаМонтажа), "ДФ = дддд");
		
		Строка.Параметры.Телефоны = "" + Выборка.Телефон + Символы.ПС + Выборка.ТелефонДополнительный;
		ТабДок.Вывести(Строка);
		
	КонецЦикла;
	
	//ТабДок.Вывести(ПустаяСтрока);
	//ТабДок.Вывести(ПустаяСтрока);
	//НомерСтроки = 2 + НомерСтроки;
	
	Область = ТабДок.Область(НачалоТекДата, 1, НомерСтроки - 1, 1);
	Область.Объединить();
	
	Возврат ТабДок;
	
КонецФункции
